## Датасет собран из базы данных переписи 1994 года и содержит данные о доходах.
### Информация о данных:
* age: continuous.
* workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
* fnlwgt: continuous.
* education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, * Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
* education-num: continuous.
* marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
* occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
* relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
* race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
* sex: Female, Male.
* capital-gain: continuous.
* capital-loss: continuous.
* hours-per-week: continuous.
* native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
* salary: >50K,<=50K

## Проведите анализ данных при помощи Pandas выполнив поставленные задачи.
####

In [7]:
import pandas as pd

In [8]:
# загружаем датасет
data = pd.read_csv("./data/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [9]:
data.shape

(32561, 15)

**1. Посчитайте, сколько мужчин и женщин (признак *sex*) представлено в этом датасете**

In [10]:
#Number of male and female
data['sex'].value_counts()

sex
Male      21790
Female    10771
Name: count, dtype: int64

**2. Каков средний возраст мужчин (признак *age*) по всему датасету?**

In [11]:
#Average age grouped by sex
data.groupby(by=['sex'], as_index=False)[['age']].mean().round(0)

      sex   age
0  Female  37.0
1    Male  39.0

**3. Какова доля граждан Соединенных Штатов (признак *native-country*)?**

In [12]:
#Percentage of United States citizens
US_citizens_percentage = data['native-country'].value_counts().loc['United-States'] / len(data)

print(f'Percentage of United States citizens: {round(US_citizens_percentage * 100, 1)}%')

Percentage of United States citizens: 89.6%

**4-5. Рассчитайте среднее значение и среднеквадратичное отклонение возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год**

In [13]:
#Age grouped by salary
data.groupby(by=['salary'])[['age']].agg(['mean','std']).round(1).reset_index()

  salary   age
          mean   std
0  <=50K  36.8  14.0
1   >50K  44.2  10.5

**6. Правда ли, что люди, которые получают больше 50k, имеют минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [14]:
#List of names for higher education feature
list_HE = ['Bachelors', 'Prof-school', 'Assoc-acdm','Assoc-voc', 'Masters', 'Doctorate']

#Check if column 'education' for people with >50K salary include only higher education
check = data[data['salary'] == '>50K']['education'].isin(list_HE).all()

print(check)

False

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Asian-Pac-Islander*.**

In [15]:
#Age grouped by race and sex
data.groupby(['race', 'sex'])[['age']].describe()

                               age                                          \
                             count       mean        std   min   25%   50%
race               sex
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0


                             75%   max
race               sex
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

Maximum age for Asian-Pac-Islander men is 90 years old.

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [16]:
#List of those considered married for marital-status feature
married_list = list(data['marital-status'][data['marital-status'].str.lower().str.startswith('married')].unique())
married_list

['Married-civ-spouse', 'Married-spouse-absent', 'Married-AF-spouse']

In [17]:
#Number of married with >50K and <=50K salary
married = data[data['marital-status'].isin(married_list)]['salary'].value_counts().reset_index()
married

  salary  count
0  <=50K   8681
1   >50K   6736

In [18]:
#Number of single with >50K and <=50K salary
single = data[~data['marital-status'].isin(married_list)]['salary'].value_counts().reset_index()
single

  salary  count
0  <=50K  16039
1   >50K   1105

In [19]:
married_50Kmore = (married['count'][1] / (married['count'][1] + married['count'][0]))
single_50Kmore = (single['count'][1] / (single['count'][1] + single['count'][0]))

print(f'Percentage of married with >50K salary - {married_50Kmore: .1%}; single - {single_50Kmore: .1%}')

Percentage of married with >50K salary -  43.7%; single -  6.4%

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [20]:
max_hours_per_week = data['hours-per-week'].max()
print(f'Maximum number of working hours per week - {max_hours_per_week}.')

Maximum number of working hours per week - 99.

In [21]:
#Number of people who work maximum number of hours per week
num_max_hours = data['hours-per-week'][data['hours-per-week'] == max_hours_per_week].count()

#Number of people working maximum number of hours per week and have >50K salary
num_max_hours_50Kmore = data['hours-per-week'][(data['hours-per-week'] == max_hours_per_week) & (data['salary'] == '>50K')].count()

percentage_50Kmore_max_hours = (num_max_hours_50Kmore / num_max_hours * 100).round(1)
print(f'Number of people working maximum number of hours per week - {num_max_hours}, \
including people with >50K salary - {percentage_50Kmore_max_hours}%.')

Number of people working maximum number of hours per week - 85, including people with >50K salary - 29.4%.

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [22]:
#Average number of hours per week grouped by native-country and salary
avg_hours_per_week = data.groupby(by=['native-country', 'salary'], as_index=False)[['hours-per-week']].mean().round(0)
avg_hours_per_week[10:20]

        native-country salary  hours-per-week
10                Cuba  <=50K            38.0
11                Cuba   >50K            42.0
12  Dominican-Republic  <=50K            42.0
13  Dominican-Republic   >50K            47.0
14             Ecuador  <=50K            38.0
15             Ecuador   >50K            49.0
16         El-Salvador  <=50K            36.0
17         El-Salvador   >50K            45.0
18             England  <=50K            40.0
19             England   >50K            45.0

**11.Сгруппируйте людей по возрастным группам *young*, *adult*, *retiree*, где:**
* *young* соответствует 16-35 лет
* *adult* - 35-70 лет
* *retiree* - 70-100 лет

**Проставьте название соответствующей группы для каждого человека в новой колонке AgeGroup**

In [23]:
data2 = data.copy()

In [24]:
cut_labels_3 = ['young', 'adult', 'retiree']
cut_bins = [16, 35, 70, 100]

data2['AgeGroup'] = pd.cut(data2['age'], bins=cut_bins, labels=cut_labels_3)

data2.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,AgeGroup
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,adult
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,adult
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,adult
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,adult
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,young

**12-13. Определите количество зарабатывающих >50K в каждой из возрастных групп (колонка AgeGroup), а также выведите название возрастной группы, в которой чаще зарабатывают больше 50К (>50K)**

In [25]:
#Data grouped by age group and salary
agegroup_salary = data2.groupby(by=['AgeGroup','salary'], observed=True, as_index=False)[['salary']].value_counts()

#Amounts by age group
sum_by_group = agegroup_salary.groupby(by=['AgeGroup'], observed=True)['count'].transform('sum')

#Percentage of people with >50K and <=50K salary by age group
agegroup_salary['percent'] = (agegroup_salary['count'] / sum_by_group * 100).round(1)

rich = agegroup_salary[agegroup_salary['salary'] == '>50K'].reset_index(drop=True)
rich.drop('percent', axis=1)

  AgeGroup salary  count
0    young   >50K   1705
1    adult   >50K   6042
2  retiree   >50K     94

In [26]:
#Age group including maximum percentage of people with >50K salary
rich[rich['percent'] == rich['percent'].max()].drop(['count', 'salary'], axis=1)

  AgeGroup  percent
1    adult     35.3

**14. Сгруппируйте людей по типу занятости (колонка occupation) и определите количество людей в каждой группе. После чего напишите функцию фильтрации filter_func, которая будет возвращать только те группы, в которых средний возраст (колонка age) не больше 40 и в которых все работники отрабатывают более 5 часов в неделю (колонка hours-per-week)**

In [27]:
#Number of people by occupation groups
grouped_occup = data.groupby(by=['occupation'], as_index=False)[['occupation']].value_counts()
grouped_occup

           occupation  count
0                   ?   1843
1        Adm-clerical   3770
2        Armed-Forces      9
3        Craft-repair   4099
4     Exec-managerial   4066
5     Farming-fishing    994
6   Handlers-cleaners   1370
7   Machine-op-inspct   2002
8       Other-service   3295
9     Priv-house-serv    149
10     Prof-specialty   4140
11    Protective-serv    649
12              Sales   3650
13       Tech-support    928
14   Transport-moving   1597

In [28]:
# Option 1

#Function for groups filtering
def filter_func1(data):
    #Average age and minimum hours-per-week by occupation groups
    gr = data.groupby(by=['occupation'], as_index=False).agg({'age': 'mean', 'hours-per-week': 'min'}).round(0)
   
    #Occupation set for age filter 
    age_filtered_set = set(gr['occupation'][gr['age'] <= 40])
    
    #Filter occupation groups for hours-per-week conditions 
    filtered_occup_hpw = data.groupby('occupation').filter(lambda x: x['hours-per-week'].min() > 5)
    #Occupation set for hours-per-week filter
    hpw_filtered_set = set(filtered_occup_hpw['occupation'])

    #Set occupation by filtered age and hours-per week
    intersection_set = age_filtered_set.intersection(hpw_filtered_set)
    
    #Excluding data by set occupation
    filtered_data = gr[gr['occupation'].isin(intersection_set)]
    
    return filtered_data

In [29]:
#Occupation groups where average age <= 40 and hours-per-week for each person in group > 5
filtered_groups = filter_func1(data)
filtered_groups

     occupation   age  hours-per-week
2  Armed-Forces  30.0               8

In [30]:
# Option 2

#Function for groups filtering
def filter_func2(data):
    #Average age and minimum hours-per-week by occupation groups
    gr = data.groupby(by=['occupation'], as_index=False).agg({'age': 'mean', 'hours-per-week': 'min'}).round(0)
   
    #Occupation set for age and hours-per-week filters
    filtered_set = set(gr['occupation'][(gr['age'] <= 40) & (gr['hours-per-week'] > 5)])
    
    #Excluding data by occupation set
    filtered_data = gr[gr['occupation'].isin(filtered_set)]
    
    return filtered_data

In [31]:
#Occupation groups where average age <= 40 and hours-per-week for each person in group > 5
filtered_groups = filter_func2(data)
filtered_groups

     occupation   age  hours-per-week
2  Armed-Forces  30.0               8